from datetime import datetime

APP_NAME = "CyberSec Toolkit"
VERSION = "1.0.0"


def get_timestamp() -> str:
    return datetime.now().strftime("%Y-%m-%d_%H-%M-%S")


def banner() -> str:
    return r"""
 ██████╗██╗   ██╗██████╗ ███████╗███████╗ ██████╗
██╔════╝╚██╗ ██╔╝██╔══██╗██╔════╝██╔════╝██╔════╝
██║      ╚████╔╝ ██████╔╝█████╗  ███████╗██║     
██║       ╚██╔╝  ██╔══██╗██╔══╝  ╚════██║██║     
╚██████╗   ██║   ██████╔╝███████╗███████║╚██████╗
 ╚═════╝   ╚═╝   ╚═════╝ ╚══════╝╚══════╝ ╚═════╝

     Ethical CyberSec Toolkit | Use Only With Permission
"""
